bit-finance/Catalogs/бит_АлгоритмыПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_АлгоритмыПроцессов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАлгоритма</Name>
					<Comment>Вид алгоритма</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыАлгоритмов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыполнения</Name>
					<Comment>Способ выполнения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыВыполненияАлгоритма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение_УУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение_МУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение_Бюдж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаМаршрута</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыАлгоритма</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрТип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Динамический</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Enums/бит_СпособыВыполненияАлгоритма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_СпособыВыполненияАлгоритма</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сразу</Name>
					<Comment>Полностью</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поэтапно</Name>
					<Comment>Поэтапно</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_ВидыТочекАлгоритмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыТочекАлгоритмов</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
					<Comment>Старт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
					<Comment>Действие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
					<Comment>Условие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
					<Comment>Разделение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
					<Comment>Слияние</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодчиненныйПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_АлгоритмыПроцессов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
	   	Возврат;	
	КонецЕсли;
	
	СпособВыполнения = Перечисления.бит_СпособыВыполненияАлгоритма.Сразу;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
		
	Если НЕ Отказ Тогда
		СоздатьТочкуСтарта();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Наименование = СтрШаблон(НСтр("ru='%1 (копия)';en='%1 (copy)'"), ОбъектКопирования.Наименование); 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ПроверитьЗаполнениеВидаАлгоритма(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура создает точку старта.
// 
// Возвращаемое значение:
//  ТочкаСтарта - СправочникСсылка.бит_ТочкиАлгоритмов - Ссылка на точку старта.
//
Функция СоздатьТочкуСтарта()
	
	ТочкаСтарта = Справочники.бит_ТочкиАлгоритмов.ПустаяСсылка();
	СоздатьТочкуСтарта = Ложь;
	Если НЕ ЭтоГруппа И ДополнительныеСвойства.Свойство("СоздатьТочкуСтарта", СоздатьТочкуСтарта) И СоздатьТочкуСтарта Тогда
		
		СпрОбъект = Справочники.бит_ТочкиАлгоритмов.СоздатьЭлемент();
		СпрОбъект.Наименование = "Старт";
		СпрОбъект.ВидТочки     = Перечисления.бит_ВидыТочекАлгоритмов.Старт;
		СпрОбъект.Владелец     = Ссылка;
		
		Если ДополнительныеСвойства.Свойство("ПервоначальноеЗаполнение")
			И ДополнительныеСвойства.ПервоначальноеЗаполнение Тогда
			СпрОбъект.ДополнительныеСвойства.Вставить("ПроверитьЗаполнение", Ложь);
		КонецЕсли;
		
		ДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОбъект,,"Ошибки");
		Если ДействиеВыполнено Тогда
			ТочкаСтарта = СпрОбъект.Ссылка;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат ТочкаСтарта;
	
КонецФункции

Процедура ПроверитьЗаполнениеВидаАлгоритма(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ВидАлгоритма) Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеВидыАлгоритмов = Перечисления.бит_ВидыАлгоритмов.ДоступныеВидыАлгоритмов();
	Если ДоступныеВидыАлгоритмов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДоступныеВидыАлгоритмов.НайтиПоЗначению(ВидАлгоритма) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='Вид алгоритма ""%1"" не доступен для текущей версии программы.'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, ВидАлгоритма);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ВидАлгоритма",, Отказ);
	
КонецПроцедуры


#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
